In [1]:
#SETUP INICIAL
import pandas
df = pandas.read_csv("common/processing_data.csv")
df

         id variable     value
0  14313738   AGT160  0.063590
1  14317404   AGT162  0.078210
2  14362561   AGT155  0.214060
3  14321720   AGT161  0.323840
4  14314713   AGT162  0.079920
5  14369775   AGT163  0.106900
6  14353801   AGT153  0.068780
7  14365883   AGT165  0.086491
8  14332650   AGT153  0.074210

<h1>Operações de conjunto</h1>
<ul>
<li>Ordenamento</li>
<li>Agrupamento</li>
<li>LIMIT</li>
<li>Diferença de conjuntos <em>(pegar só o que tem em um e não no outro)</em></li>
</ul>

<strong>Ordenar por variable e value, agrupar por variable, pegar somente o maior value</strong>

In [7]:
df.sort_values(by=['variable','value'], ascending=False).groupby('variable').head(1)

         id variable     value
7  14365883   AGT165  0.086491
5  14369775   AGT163  0.106900
4  14314713   AGT162  0.079920

<strong>Diferença de conjuntos</strong>
<br/><em>Significa pegar somente o que sobrou</em>

In [29]:
df2 = df
df1 = df.sort_values(by=['variable','value'], ascending=False).groupby('variable').head(1)
#Isto é o que tem em df2 mas não tem em df1.
#Se df2 e df1 são conjuntos, isto é o equivalente a df2 - df1
df2[~df2.isin(df1).all(1)]

         id variable    value
1  14317404   AGT162  0.07821
6  14353801   AGT153  0.06878

<h1>Operações não específicas</h1>
<br/><em>Coisas úteis de vez enquando</em>
<ul>
<li>Selecionar colunas</li>
<li>Selecionar linhas de acordo com valor da coluna</li>
<li>Iterar as linhas do dataframe</li>
<li>Concatenando dataframes</li>
</ul>

<strong>não selecionar todas colunas:</strong>

In [6]:
df[['variable','value']]

  variable     value
0   AGT160  0.063590
1   AGT162  0.078210
2   AGT155  0.214060
3   AGT161  0.323840
4   AGT162  0.079920
5   AGT163  0.106900
6   AGT153  0.068780
7   AGT165  0.086491
8   AGT153  0.074210

<strong>também pode ser:</strong>

In [8]:
df.ix[:, df.columns != 'id']

  variable     value
0   AGT160  0.063590
1   AGT162  0.078210
2   AGT155  0.214060
3   AGT161  0.323840
4   AGT162  0.079920
5   AGT163  0.106900
6   AGT153  0.068780
7   AGT165  0.086491
8   AGT153  0.074210

<strong>Selecionar linhas de acordo com valor da coluna</strong>

In [43]:
# Similar ao WHERE do SQL
df.loc[df['variable'] == 'AGT153']

         id variable    value
6  14353801   AGT153  0.06878
8  14332650   AGT153  0.07421

In [44]:
# Similar ao variable__in=['AGT153','AGT162'] da ORM do Django
df.loc[df['variable'].isin(['AGT153','AGT162'])]

         id variable    value
1  14317404   AGT162  0.07821
4  14314713   AGT162  0.07992
6  14353801   AGT153  0.06878
8  14332650   AGT153  0.07421

In [13]:
# Misturando os dois
df.loc[(df['value'] < 0.5) & df['variable'].isin(['AGT153','AGT162'])]

         id variable    value
1  14317404   AGT162  0.07821
4  14314713   AGT162  0.07992
6  14353801   AGT153  0.06878
8  14332650   AGT153  0.07421

<strong>Iterar as linhas do dataframe</strong>

In [42]:
for row in df.itertuples():
    print row[0],row[1],row[2],row[3]

0 14313738 AGT160 0.06359
1 14317404 AGT162 0.07821
2 14362561 AGT155 0.21406
3 14321720 AGT161 0.32384
4 14314713 AGT162 0.07992
5 14369775 AGT163 0.1069
6 14353801 AGT153 0.06878
7 14365883 AGT165 0.08649125
8 14332650 AGT153 0.07421

<strong>Concatenando dataframes</strong>

In [45]:
df1 = df.loc[df['variable'] == 'AGT153']
df2 = df.loc[df['variable'] != 'AGT153']
df3 = df1.append(df2)
df3

         id variable     value
6  14353801   AGT153  0.068780
8  14332650   AGT153  0.074210
0  14313738   AGT160  0.063590
1  14317404   AGT162  0.078210
2  14362561   AGT155  0.214060
3  14321720   AGT161  0.323840
4  14314713   AGT162  0.079920
5  14369775   AGT163  0.106900
7  14365883   AGT165  0.086491